РП/src/InformationRegisters/ПредметыКонтролируемыхОпераций/ПредметыКонтролируемыхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПредметыКонтролируемыхОпераций</name>
  <resources>
    <name>КодПредмета</name>
    <comment>Додаток 4 порядку складання звіту про контрольовані операції - 1,2,3</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодКлассификатораПродукцииИУслуг</name>
    <comment>ДК 016:2010, Наказ №457 від 11.10.2010</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодУКТВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторУКТВЭД</types>
    </type>
  </resources>
  <resources>
    <name>КодУКВЭП</name>
    <comment>КЗЕП, Наказ №69 від 27.02.2013</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодСтраныПроисхождения</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТорговаяМарка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Производитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ПредметСделки</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

РП/src/InformationRegisters/ПредметыКонтролируемыхОпераций/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокКодов = КонтролируемыеОперацииПовтИсп.ПолучитьСписокВыбораКодыТипПредмета();
	Для каждого ЭлементСпискаКодов Из СписокКодов Цикл
		Элементы.КодПредмета.СписокВыбора.Добавить(ЭлементСпискаКодов.Значение, ЭлементСпискаКодов.Представление);
	КонецЦикла;

	СписокКодов = КонтролируемыеОперацииПовтИсп.ПолучитьСписокКодовСтран();
	Для каждого ЭлементСпискаКодов Из СписокКодов Цикл
		Элементы.КодСтраныПроисхождения.СписокВыбора.Добавить(ЭлементСпискаКодов.Значение, ЭлементСпискаКодов.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметСделкиПриИзменении(Элемент)
	
	ПредметСделкиПриИзмененииНаСервере(Запись.ПредметСделки, Запись.КодПредмета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПредметСделкиПриИзмененииНаСервере(Номенклатура, КодПредмета)
	
	Тип = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ВидНоменклатуры.ТипНоменклатуры");
	
	Если Тип = Перечисления.ТипыНоменклатуры.Товар Тогда
		КодПредмета = "201";
	ИначеЕсли Тип = Перечисления.ТипыНоменклатуры.Услуга Тогда
		КодПредмета = "204";
	ИначеЕсли Тип = Перечисления.ТипыНоменклатуры.Работа Тогда
		КодПредмета = "207";	
	КонецЕсли;
	
КонецПроцедуры
